package com.sayzen.campfiresdk.app.develop


/*



    XXX Баг. Вылеты уведомлений в гайдах
    XXX Доработать тотальный гайд. Сделать категории. Добавить ссылку на кемп
    XXX Ограничить количество показов 10 в день на пользователя
    XXX Нельзя удалить черновик
    Used to be useful but after coming back to it after a while I keep getting an 888 betting ad that keeps crashing the damn app making me need to restart it making it useless.


    Ключ авторизации

    Карты. Сообщать о максимальных размерах карты
    Баг. все еще не работает переход по уведомлению



    Приложение по адонам (только онлайн)
    - Категории
    - Картинки для категорий
    - Возможность скачать
    - Возможность загрузить
    - Наполнить
    - Иконка
    - Белая иконка
    - Реклама в других приложениях
    - Рекламные ключи
    - Гугловские ключи

 */
