package com.sayzen.campfiresdk.app.develop


/*
    Загрузка картинок с сервера
    Карточка рекламы
    Исправить баг с частыми запросами о AD
    Категории в онлайне
    Ключ авторизации















    Карты. Сообщать о максимальных размерах карты
    Баг. все еще не работает переход по уведомлению



    Приложение по адонам (только онлайн)
    - Категории
    - Картинки для категорий
    - Возможность скачать
    - Возможность загрузить
    - Наполнить
    - Иконка
    - Белая иконка
    - Реклама в других приложениях
    - Рекламные ключи
    - Гугловские ключи

 */
