package com.sayzen.campfiresdk.app.develop


/*


    Баг. При регистрации сразу не открывает созданеи гайда
    Баг. В гайдах пишет что будет опубликована карта


    Карты. Сообщать о максимальных размерах карты
    Баг. все еще не работает переход по уведомлению




    Приложение по аадонам (только онлайн)
    - Категории
    - Картинки для категорий
    - Возможность скачать
    - Возможность загрузить
    - Наполнить
    - Иконка
    - Белая иконка
    - Реклама в других приложениях
    - Рекламные ключи
    - Гугловские ключи

 */
